latency-results-2nodes-wr/100-100.txt
Running 1m test @ http://west4:3000/100.txt
  24 threads and 100 connections
  Thread calibration: mean lat.: 2257.741ms, rate sampling interval: 8019ms
  Thread calibration: mean lat.: 2271.111ms, rate sampling interval: 8040ms
  Thread calibration: mean lat.: 2258.082ms, rate sampling interval: 8114ms
  Thread calibration: mean lat.: 2252.698ms, rate sampling interval: 7987ms
  Thread calibration: mean lat.: 2274.465ms, rate sampling interval: 8101ms
  Thread calibration: mean lat.: 2263.845ms, rate sampling interval: 8101ms
  Thread calibration: mean lat.: 2274.374ms, rate sampling interval: 8089ms
  Thread calibration: mean lat.: 2284.826ms, rate sampling interval: 8036ms
  Thread calibration: mean lat.: 2252.947ms, rate sampling interval: 8056ms
  Thread calibration: mean lat.: 2247.110ms, rate sampling interval: 7962ms
  Thread calibration: mean lat.: 2283.111ms, rate sampling interval: 8146ms
  Thread calibration: mean lat.: 2250.280ms, rate sampling interval: 7987ms
  Thread calibration: mean lat.: 2265.095ms, rate sampling interval: 8024ms
  Thread calibration: mean lat.: 2245.947ms, rate sampling interval: 7983ms
  Thread calibration: mean lat.: 2251.065ms, rate sampling interval: 8032ms
  Thread calibration: mean lat.: 2262.516ms, rate sampling interval: 8028ms
  Thread calibration: mean lat.: 2246.368ms, rate sampling interval: 7999ms
  Thread calibration: mean lat.: 2249.760ms, rate sampling interval: 8007ms
  Thread calibration: mean lat.: 2248.604ms, rate sampling interval: 8028ms
  Thread calibration: mean lat.: 2245.286ms, rate sampling interval: 7987ms
  Thread calibration: mean lat.: 2249.342ms, rate sampling interval: 8019ms
  Thread calibration: mean lat.: 2280.083ms, rate sampling interval: 8134ms
  Thread calibration: mean lat.: 2265.095ms, rate sampling interval: 8024ms
  Thread calibration: mean lat.: 2240.526ms, rate sampling interval: 7958ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.94s     3.77s   17.07s    62.57%
    Req/Sec    26.60     22.72   126.00     67.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.09s 
 75.000%   13.09s 
 90.000%   14.88s 
 99.000%   15.93s 
 99.900%   16.58s 
 99.990%   16.96s 
 99.999%   17.09s 
100.000%   17.09s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.640     0.000000            1         1.00
    5255.167     0.100000         3151         1.11
    6463.487     0.200000         6271         1.25
    7675.903     0.300000         9405         1.43
    8888.319     0.400000        12546         1.67
   10092.543     0.500000        15674         2.00
   10698.751     0.550000        17250         2.22
   11296.767     0.600000        18810         2.50
   11894.783     0.650000        20373         2.86
   12492.799     0.700000        21928         3.33
   13090.815     0.750000        23495         4.00
   13393.919     0.775000        24298         4.44
   13688.831     0.800000        25066         5.00
   13991.935     0.825000        25853         5.71
   14286.847     0.850000        26624         6.67
   14589.951     0.875000        27416         8.00
   14737.407     0.887500        27799         8.89
   14884.863     0.900000        28186        10.00
   15032.319     0.912500        28579        11.43
   15187.967     0.925000        28997        13.33
   15327.231     0.937500        29362        16.00
   15400.959     0.943750        29562        17.78
   15474.687     0.950000        29761        20.00
   15548.415     0.956250        29959        22.86
   15622.143     0.962500        30159        26.67
   15695.871     0.968750        30355        32.00
   15728.639     0.971875        30456        35.56
   15769.599     0.975000        30556        40.00
   15794.175     0.978125        30633        45.71
   15835.135     0.981250        30742        53.33
   15867.903     0.984375        30838        64.00
   15884.287     0.985938        30881        71.11
   15908.863     0.987500        30941        80.00
   15917.055     0.989062        30978        91.43
   15941.631     0.990625        31033       106.67
   15966.207     0.992188        31083       128.00
   15974.399     0.992969        31100       142.22
   15990.783     0.993750        31130       160.00
   16007.167     0.994531        31148       182.86
   16023.551     0.995313        31173       213.33
   16056.319     0.996094        31195       256.00
   16072.703     0.996484        31209       284.44
   16105.471     0.996875        31222       320.00
   16130.047     0.997266        31234       365.71
   16162.815     0.997656        31244       426.67
   16203.775     0.998047        31256       512.00
   16228.351     0.998242        31263       568.89
   16252.927     0.998437        31269       640.00
   16293.887     0.998633        31276       731.43
   16416.767     0.998828        31281       853.33
   16588.799     0.999023        31287      1024.00
   16662.527     0.999121        31290      1137.78
   16703.487     0.999219        31293      1280.00
   16744.447     0.999316        31296      1462.86
   16793.599     0.999414        31300      1706.67
   16826.367     0.999512        31302      2048.00
   16842.751     0.999561        31304      2275.56
   16859.135     0.999609        31305      2560.00
   16891.903     0.999658        31308      2925.71
   16891.903     0.999707        31308      3413.33
   16908.287     0.999756        31310      4096.00
   16924.671     0.999780        31313      4551.11
   16924.671     0.999805        31313      5120.00
   16924.671     0.999829        31313      5851.43
   16924.671     0.999854        31313      6826.67
   16957.439     0.999878        31314      8192.00
   16957.439     0.999890        31314      9102.22
   16957.439     0.999902        31314     10240.00
   17006.591     0.999915        31315     11702.86
   17006.591     0.999927        31315     13653.33
   17039.359     0.999939        31316     16384.00
   17039.359     0.999945        31316     18204.44
   17039.359     0.999951        31316     20480.00
   17039.359     0.999957        31316     23405.71
   17039.359     0.999963        31316     27306.67
   17088.511     0.999969        31317     32768.00
   17088.511     1.000000        31317          inf
#[Mean    =     9941.274, StdDeviation   =     3767.593]
#[Max     =    17072.128, Total count    =        31317]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  42501 requests in 1.00m, 4.06GB read
  Socket errors: connect 94, read 0, write 0, timeout 1032
Requests/sec:    707.82
Transfer/sec:     69.28MB
------------------------100--DONE------------------------