latency-results-2nodes-wr/1000-10.txt
Running 1m test @ http://west4:3000/10.txt
  24 threads and 1000 connections
  Thread calibration: mean lat.: 816.263ms, rate sampling interval: 5242ms
  Thread calibration: mean lat.: 958.290ms, rate sampling interval: 5545ms
  Thread calibration: mean lat.: 792.042ms, rate sampling interval: 5132ms
  Thread calibration: mean lat.: 675.038ms, rate sampling interval: 4472ms
  Thread calibration: mean lat.: 944.237ms, rate sampling interval: 5234ms
  Thread calibration: mean lat.: 785.291ms, rate sampling interval: 5066ms
  Thread calibration: mean lat.: 728.001ms, rate sampling interval: 4579ms
  Thread calibration: mean lat.: 1150.837ms, rate sampling interval: 6508ms
  Thread calibration: mean lat.: 828.180ms, rate sampling interval: 4964ms
  Thread calibration: mean lat.: 824.089ms, rate sampling interval: 5062ms
  Thread calibration: mean lat.: 749.481ms, rate sampling interval: 4562ms
  Thread calibration: mean lat.: 639.088ms, rate sampling interval: 4175ms
  Thread calibration: mean lat.: 788.485ms, rate sampling interval: 4919ms
  Thread calibration: mean lat.: 978.902ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1008.423ms, rate sampling interval: 5586ms
  Thread calibration: mean lat.: 708.664ms, rate sampling interval: 4562ms
  Thread calibration: mean lat.: 734.615ms, rate sampling interval: 4321ms
  Thread calibration: mean lat.: 807.187ms, rate sampling interval: 4571ms
  Thread calibration: mean lat.: 1183.040ms, rate sampling interval: 6508ms
  Thread calibration: mean lat.: 1148.306ms, rate sampling interval: 5619ms
  Thread calibration: mean lat.: 984.809ms, rate sampling interval: 5287ms
  Thread calibration: mean lat.: 817.961ms, rate sampling interval: 4837ms
  Thread calibration: mean lat.: 940.532ms, rate sampling interval: 5545ms
  Thread calibration: mean lat.: 844.046ms, rate sampling interval: 5099ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26s     1.82s   15.04s    88.27%
    Req/Sec    82.66      8.49   111.00     77.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  565.25ms
 75.000%    1.83s 
 90.000%    3.58s 
 99.000%    6.93s 
 99.900%   13.84s 
 99.990%   14.70s 
 99.999%   14.73s 
100.000%   15.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.571     0.000000            1         1.00
      14.799     0.100000         9896         1.11
      34.847     0.200000        19792         1.25
      67.903     0.300000        29692         1.43
     200.319     0.400000        39584         1.67
     565.247     0.500000        49497         2.00
     631.807     0.550000        54442         2.22
     790.527     0.600000        59388         2.50
    1086.463     0.650000        64325         2.86
    1431.551     0.700000        69277         3.33
    1827.839     0.750000        74220         4.00
    2105.343     0.775000        76716         4.44
    2222.079     0.800000        79168         5.00
    2541.567     0.825000        81664         5.71
    2633.727     0.850000        84162         6.67
    2887.679     0.875000        86588         8.00
    3223.551     0.887500        87825         8.89
    3581.951     0.900000        89062        10.00
    3981.311     0.912500        90300        11.43
    4370.431     0.925000        91537        13.33
    4833.279     0.937500        92772        16.00
    5160.959     0.943750        93396        17.78
    5292.031     0.950000        94010        20.00
    5627.903     0.956250        94634        22.86
    5791.743     0.962500        95245        26.67
    6103.039     0.968750        95895        32.00
    6139.903     0.971875        96210        35.56
    6287.359     0.975000        96484        40.00
    6500.351     0.978125        96799        45.71
    6582.271     0.981250        97111        53.33
    6606.847     0.984375        97471        64.00
    6619.135     0.985938        97568        71.11
    6770.687     0.987500        97723        80.00
    6840.319     0.989062        97874        91.43
    7045.119     0.990625        98028       106.67
    7647.231     0.992188        98182       128.00
    8228.863     0.992969        98260       142.22
    8847.359     0.993750        98342       160.00
    9617.407     0.994531        98415       182.86
   10297.343     0.995313        98493       213.33
   11132.927     0.996094        98571       256.00
   11517.951     0.996484        98608       284.44
   11943.935     0.996875        98646       320.00
   12197.887     0.997266        98685       365.71
   12656.639     0.997656        98729       426.67
   13107.199     0.998047        98763       512.00
   13148.159     0.998242        98783       568.89
   13352.959     0.998437        98801       640.00
   13623.295     0.998633        98824       731.43
   13680.639     0.998828        98840       853.33
   13844.479     0.999023        98859      1024.00
   14098.431     0.999121        98869      1137.78
   14114.815     0.999219        98879      1280.00
   14139.391     0.999316        98888      1462.86
   14237.695     0.999414        98898      1706.67
   14286.847     0.999512        98907      2048.00
   14573.567     0.999561        98916      2275.56
   14589.951     0.999609        98924      2560.00
   14589.951     0.999658        98924      2925.71
   14598.143     0.999707        98934      3413.33
   14598.143     0.999756        98934      4096.00
   14598.143     0.999780        98934      4551.11
   14606.335     0.999805        98944      5120.00
   14606.335     0.999829        98944      5851.43
   14606.335     0.999854        98944      6826.67
   14606.335     0.999878        98944      8192.00
   14696.447     0.999890        98948      9102.22
   14696.447     0.999902        98948     10240.00
   14696.447     0.999915        98948     11702.86
   14696.447     0.999927        98948     13653.33
   14721.023     0.999939        98951     16384.00
   14721.023     0.999945        98951     18204.44
   14721.023     0.999951        98951     20480.00
   14721.023     0.999957        98951     23405.71
   14729.215     0.999963        98954     27306.67
   14729.215     0.999969        98954     32768.00
   14729.215     0.999973        98954     36408.89
   14729.215     0.999976        98954     40960.00
   14729.215     0.999979        98954     46811.43
   14729.215     0.999982        98954     54613.33
   14729.215     0.999985        98954     65536.00
   14729.215     0.999986        98954     72817.78
   14729.215     0.999988        98954     81920.00
   14729.215     0.999989        98954     93622.86
   15048.703     0.999991        98955    109226.67
   15048.703     1.000000        98955          inf
#[Mean    =     1259.173, StdDeviation   =     1821.755]
#[Max     =    15040.512, Total count    =        98955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  117100 requests in 1.00m, 1.14GB read
  Socket errors: connect 0, read 0, write 0, timeout 6021
Requests/sec:   1947.82
Transfer/sec:     19.46MB
------------------------1000--DONE------------------------